<?php

namespace Aijoh\Core\Tests\Support;

use Aijoh\Core\Support\Japanese;

test('normalize テスト', function ($base, $expected) {
    $this->assertEquals($expected, Japanese::normalize($base));
})->with(
    [
        '半角カタカナ=>全角カタカナ' => [
            'ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟ',
            'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロワン゛゜',
        ],
        '全角英数字(大文字・小文字)=>半角英数字(大文字・小文字)' => [
            'ＡＢＣＤＥＦＧＨＩＪＫＬＭＮＯＰＱＲＳＴＵＶＷＸＹＺａｂｃｄｅｆｇｈｉｊｋｌｍｎｏｐｑｒｓｔｕｖｗｘｙｚ０１２３４５６７８９',
            'ABCDEFGHIJKLMNOPQRSTUVWXYZabcdefghijklmnopqrstuvwxyz0123456789',
        ],
        '全角記号=>半角記号' => [
            '！”＃＄％＆’（）＊＋，－．／：；＜＝＞？＠［￥］＾＿‘｛｜｝',
            '!"#$%&\'()*+,-./:;<=>?@[\\]^_`{|}',
        ],
        '合成文字の変換' => [
            "か\u{3099}は\u{309A}ハ\u{3099}ワ\u{3099}",
            'がぱバヷ',
        ],
        '空白文字=>半角空白' => [
            "　あいうえお\u{1D17A}かきくけこ　さしすせそ",
            ' あいうえお かきくけこ さしすせそ',
        ],
    ]
);

test('ひらがなに変換', function ($base, $expected) {
    $this->assertEquals($expected, Japanese::toHiragana($base));
})->with(
    [
        '合成文字の変換' => [
            "か\u{3099}は\u{309A}ハ\u{3099}",
            'がぱば',
        ],
        '合成文字カタカナの変換' => [
            "ハ\u{3099}ヒ\u{3099}フ\u{3099}ヘ\u{3099}ホ\u{3099}ハ\u{309A}ヒ\u{309A}フ\u{309A}ヘ\u{309A}ホ\u{309A}",
            'ばびぶべぼぱぴぷぺぽ',
        ],
        '全角カタカナ=>ひらがな' => [
            'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロワン゛゜',
            'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろわん゛゜',
        ],
        '半角カタカナ=>ひらがな' => [
            'ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟ',
            'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろわん゛゜',
        ],
    ]
);

test('カタカナに変換', function ($base, $expected) {
    $this->assertEquals($expected, Japanese::toKatakana($base));
})->with(
    [
        '合成文字の変換' => [
            "か\u{3099}は\u{309A}ハ\u{3099}",
            'ガパバ',
        ],
        '合成文字カタカナの変換' => [
            "ハ\u{3099}ヒ\u{3099}フ\u{3099}ヘ\u{3099}ホ\u{3099}ハ\u{309A}ヒ\u{309A}フ\u{309A}ヘ\u{309A}ホ\u{309A}",
            'バビブベボパピプペポ',
        ],
        '全角ひらがな=>カタカナ' => [
            'ぁあぃいぅうぇえぉおかがきぎくぐけげこごさざしじすずせぜそぞただちぢっつづてでとどなにぬねのはばぱひびぴふぶぷへべぺほぼぽまみむめもゃやゅゆょよらりるれろわん゛゜',
            'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロワン゛゜',

        ],
        '半角カタカナ=>全角カタカナ' => [
            'ｧｱｨｲｩｳｪｴｫｵｶｶﾞｷｷﾞｸｸﾞｹｹﾞｺｺﾞｻｻﾞｼｼﾞｽｽﾞｾｾﾞｿｿﾞﾀﾀﾞﾁﾁﾞｯﾂﾂﾞﾃﾃﾞﾄﾄﾞﾅﾆﾇﾈﾉﾊﾊﾞﾊﾟﾋﾋﾞﾋﾟﾌﾌﾞﾌﾟﾍﾍﾞﾍﾟﾎﾎﾞﾎﾟﾏﾐﾑﾒﾓｬﾔｭﾕｮﾖﾗﾘﾙﾚﾛﾜﾝﾞﾟ',
            'ァアィイゥウェエォオカガキギクグケゲコゴサザシジスズセゼソゾタダチヂッツヅテデトドナニヌネノハバパヒビピフブプヘベペホボポマミムメモャヤュユョヨラリルレロワン゛゜',
        ],
    ]
);
